doom/config.el

(use-package! websocket
  :after org-roam)

(use-package! org-roam-ui
  :after org-roam
  :config
  ;; Sync theme, follow the node in the graph, update on save, and open on start
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t))

(defun date-three-days-later ()
  "Return the date three days from today in the format YYYY-MM-DD."
  (let* ((today (current-time))                         ;; Get the current time
         (three-days-later (time-add today (* 3 24 60 60))) ;; Add three days to current time
         (date-string (format-time-string "%Y-%m-%d" three-days-later))) ;; Format the new date
    date-string))

;; Calculate the date three days later and store it in a variable
(let ((date-three-days-later (date-three-days-later)))
  (setq org-agenda-custom-commands
        `(("c" "Super view"
           ((alltodo "" ((org-agenda-overriding-header "")
                         (org-super-agenda-groups
                          '((:name "Actionable Today"
                             :deadline today
                             :scheduled today
                             :face (:foreground "green")
                             :order 1)
                            (:name "Overdue"
                             :deadline past
                             :face (:foreground "red")
                             :order 2)
                            (:name "Deadline soon"
                                   :face (:foreground "orange")
                                   :deadline (before ,date-three-days-later)
                                   :order 3)
                            (:habit t)
                            (:name "Scheduled for Future"
                             :scheduled future
                             :face (:foreground "blue")
                             :order 4)
                            (:name "In Progress"
                             :todo ("STRT" "WAIT" "HOLD")
                             :and (:scheduled past :deadline future)
                             :order 5)
                            (:name "Not yet started"
                             :todo ("TODO" "PROJ" "IDEA")
                             :scheduled nil
                             :deadline nil
                             :order 6))))))))))

(use-package! org-super-agenda
  :after org-agenda
  :config
  (org-super-agenda-mode))

(use-package! org-modern
  :hook (org-mode . org-modern-mode)
  :config
  (setq
   ;; Edit settings
   org-fold-catch-invisible-edits 'show-and-error
   org-special-ctrl-a/e t
   org-insert-heading-respect-content t
   ;; Appearance
   org-modern-radio-target    '("❰" t "❱")
   org-modern-internal-target '("↪ " t "")
   org-modern-todo nil
   org-modern-tag t
   org-modern-star 'replace
   org-modern-block-name nil
   org-modern-timestamp nil
   org-modern-statistics nil
   org-modern-table nil
   org-modern-progress 12
   org-modern-priority nil
   org-modern-horizontal-rule "──────────"
   org-modern-keyword nil
   org-agenda-tags-column 0
   org-modern-list '((43 . "•")
                     (45 . "–")
                     (42 . "↪")))
  (custom-set-faces!
    ;; `((org-modern-tag)
    ;;   :background ,(doom-blend (doom-color 'blue) (doom-color 'bg) 0.1)
    ;;   :foreground ,(doom-color 'grey))
    `((org-modern-radio-target org-modern-internal-target)
      :inherit 'default :foreground ,(doom-color 'blue)))
  )

(use-package! org-appear
  :hook (org-mode . org-appear-mode)
  :config
  (setq org-appear-autoemphasis t
        org-appear-autosubmarkers t
        org-appear-autolinks nil)
  ;; for proper first-time setup, `org-appear--set-elements'
  ;; needs to be run after other hooks have acted.
  (run-at-time nil nil #'org-appear--set-elements))
