doom/config.el

(use-package! svg-tag-mode
  :config
  (defconst date-re "[0-9]\\{4\\}-[0-9]\\{2\\}-[0-9]\\{2\\}")
  (defconst time-re "[0-9]\\{2\\}:[0-9]\\{2\\}")
  (defconst day-re "[A-Za-z]\\{3\\}")
  (defconst day-time-re (format "\\(%s\\)? ?\\(%s\\)?" day-re time-re))

  (defun svg-progress-percent (value)
    (save-match-data
    (svg-image (svg-lib-concat
                (svg-lib-progress-bar
                 (/ (string-to-number value) 100.0) nil
                 :height 0.8 :foreground (doom-color 'fg) :background (doom-color 'bg)
                 :margin 0 :stroke 2 :radius 3 :padding 2 :width 11)
                (svg-lib-tag (concat value "%") nil
                             :height 0.8 :foreground (doom-color 'fg) :background (doom-color 'bg)
                             :stroke 0 :margin 0)) :ascent 'center)))

(defun svg-progress-count (value)
  (save-match-data
    (let* ((seq (split-string value "/"))
           (count (if (stringp (car seq))
                      (float (string-to-number (car seq)))
                    0))
           (total (if (stringp (cadr seq))
                      (float (string-to-number (cadr seq)))
                    1000)))
      (svg-image (svg-lib-concat
                  (svg-lib-progress-bar (/ count total) nil
                                        :foreground (doom-color 'fg)
                                        :background (doom-color 'bg) :height 0.8
                                        :margin 0 :stroke 2 :radius 3 :padding 2 :width 11)
                  (svg-lib-tag value nil
                               :foreground (doom-color 'fg)
                               :background (doom-color 'bg)
                               :stroke 0 :margin 0 :height 0.8)) :ascent 'center))))

  (set-face-attribute 'svg-tag-default-face nil :family "Cartograph Sans CF")
  (setq svg-tag-tags
        `(;; Task priority e.g. [#A], [#B], or [#C]
          ("\\[#A\\]" . ((lambda (tag) (svg-tag-make tag :face 'error :inverse t :height .9
                                                     :beg 2 :end -1 :margin 0 :radius 10))))
          ("\\[#B\\]" . ((lambda (tag) (svg-tag-make tag :face 'warning :inverse t :height .9
                                                     :beg 2 :end -1 :margin 0 :radius 10))))
          ("\\[#C\\]" . ((lambda (tag) (svg-tag-make tag :face 'org-todo :inverse t :height .9
                                                     :beg 2 :end -1 :margin 0 :radius 10))))
          ;; ("\\(:#[A-Za-z0-9]+\\)" . ((lambda (tag)
          ;;                            (svg-tag-make tag :beg 2 :inverse t :margin 1 :face (doom-color 'blue) ))))
          ;; ("\\(:#[A-Za-z0-9]+:\\)$" . ((lambda (tag)
          ;;                              (svg-tag-make tag :beg 2 :end -1 :inverse t :margin 1 :face (doom-color 'blue)))))


        ;; Active date (with or without day name, with or without time)
        ;; (,(format "\\(<%s>\\)" date-re) .
        ;;  ((lambda (tag)
        ;;     (svg-tag-make tag :beg 1 :end -1 :margin 0))))
        ;; (,(format "\\(<%s \\)%s>" date-re day-time-re) .
        ;;  ((lambda (tag)
        ;;     (svg-tag-make tag :beg 1 :inverse nil :crop-right t :margin 0))))
        ;; (,(format "<%s \\(%s>\\)" date-re day-time-re) .
        ;;  ((lambda (tag)
        ;;     (svg-tag-make tag :end -1 :inverse t :crop-left t :margin 0))))

        ;; ;; Inactive date  (with or without day name, with or without time)
        ;;  (,(format "\\(\\[%s\\]\\)" date-re) .
        ;;   ((lambda (tag)
        ;;      (svg-tag-make tag :beg 1 :end -1 :margin 0 :face 'org-date))))
        ;;  (,(format "\\(\\[%s \\)%s\\]" date-re day-time-re) .
        ;;   ((lambda (tag)
        ;;      (svg-tag-make tag :beg 1 :inverse nil :crop-right t :margin 0 :face 'org-date))))
        ;;  (,(format "\\[%s \\(%s\\]\\)" date-re day-time-re) .
        ;;   ((lambda (tag)
        ;;      (svg-tag-make tag :end -1 :inverse t :crop-left t :margin 0 :face 'org-date))))

          ;; Keywords
          ("TODO" . ((lambda (tag) (svg-tag-make tag :inverse t :height .85 :face 'org-todo))))
          ("HOLD" . ((lambda (tag) (svg-tag-make tag :inverse t :height .85 :face '+org-todo-onhold))))
          ("DONE" . ((lambda (tag) (svg-tag-make tag :height .85 :face 'org-todo))))
          ("KILL" . ((lambda (tag) (svg-tag-make tag :inverse t :height .85 :face '+org-todo-cancel))))
          ("STRT\\|WAIT" . ((lambda (tag) (svg-tag-make tag :inverse t :height .85 :face '+org-todo-active))))
          ("EVNT\\|PROJ\\|IDEA" .
           ((lambda (tag) (svg-tag-make tag :inverse t :height .85 :face '+org-todo-project))))
          ("REVI" . ((lambda (tag) (svg-tag-make tag :inverse t :height .85 :face '+org-todo-onhold))))))

  :hook (org-mode . svg-tag-mode))

(setq +latex-viewers '(zathura))
(map! :map cdlatex-mode-map
      :i "TAB" #'cdlatex-tab) ;; Use TAB for cdlatex completion

(use-package! nov
