doom/config.org
* nov.el
nov.el is an Emacs mode for reading EPUB files. This configuration customizes the appearance and behavior of nov-mode.

#+begin_src emacs-lisp :tangle no
(use-package! calibredb
  :commands calibredb
  :config
  (setq calibredb-root-dir "~/Calibre Library"
        calibredb-db-dir (expand-file-name "metadata.db" calibredb-root-dir)))
#+end_src

#+begin_src emacs-lisp :tangle yes
(use-package! nov
  :mode ("\\.epub\\'" . nov-mode)
  :config
  (map! :map nov-mode-map
        :n "RET" #'nov-scroll-up)

  (advice-add 'nov-render-title :override #'ignore)

  (defun +nov-mode-setup ()
    "Tweak nov-mode to our liking."
    (face-remap-add-relative 'variable-pitch
                             :family "Alegreya"
                             :height 1.1
                             :width 'semi-expanded)
    (face-remap-add-relative 'default :height 1.1)
    (variable-pitch-mode 1)
    (setq-local line-spacing 0.2
                next-screen-context-lines 4
                shr-use-colors nil)
    (when (require 'visual-fill-column nil t)
      (setq-local visual-fill-column-center-text t
                  visual-fill-column-width 64
                  nov-text-width 106)
      (visual-fill-column-mode 1))
    (when (featurep 'hl-line-mode)
      (hl-line-mode -1))
    ;; Re-render with new display settings
    (nov-render-document)
    ;; Look up words with the dictionary.
    (add-to-list '+lookup-definition-functions #'+lookup/dictionary-definition))

  (add-hook 'nov-mode-hook #'+nov-mode-setup))

(defun org-nov-open-new-window (path)
  "Open nov.el link in a new window."
  (setq available-windows
        (delete (selected-window) (window-list)))
  (setq new-window
        (or (car available-windows)
            (split-window-sensibly)
            (split-window-right)))
  (select-window new-window)
  (nov-org-link-follow path))
#+end_src

* Completion
#+begin_src emacs-lisp :tangle yes
(use-package! corfu
  :config
  (defun corfu-enable-in-minibuffer ()
    "Enable Corfu in the minibuffer if `completion-at-point' is bound."
    (when (where-is-internal #'completion-at-point (list (current-local-map)))
      ;; (setq-local corfu-auto nil) ;; Enable/disable auto completion
      (setq-local corfu-echo-delay nil ;; Disable automatic echo and popup
                  corfu-popupinfo-delay nil)
      (corfu-mode 1)))
  (add-hook 'minibuffer-setup-hook #'corfu-enable-in-minibuffer))
(use-package! orderless
  :config
  (add-to-list 'orderless-matching-styles 'char-fold-to-regexp))

(setq corfu-auto-delay 0.3)
(setq yas-triggers-in-field t)

(custom-set-faces! '((corfu-popupinfo) :height 0.9))
#+end_src

* Tools
** IPYNB to markdown

#+begin_src emacs-lisp :tangle no
(defun ipynb-to-markdown (file)
  (interactive "f")
  (let* ((data (with-temp-buffer
                 (insert-file-contents file)
                 (json-parse-buffer :object-type 'alist
                                    :array-type 'list)))
         (metadata (alist-get 'metadata data))
         (language-info (alist-get 'language_info metadata))
         (language (alist-get 'name language-info)))
    (pop-to-buffer "ipynb-as-markdown")
    (when (featurep 'markdown-mode)
      (markdown-mode))
    (dolist (cell (alist-get 'cells data))
      (let ((cell-type (alist-get 'cell_type cell))
            (source (alist-get 'source cell))
            (outputs (alist-get 'outputs cell)))
        (pcase cell-type
          ("markdown"
           (when source
             (mapc #'insert source)
             (insert "\n\n")))
          ("code"
           (when source
             (insert (format "```%s\n" language))
             (mapc #'insert source)
             (insert "\n```\n\n")
             (dolist (output outputs)
               (let ((output-text (alist-get 'text output))
                     (output-data (alist-get 'data output)))
                 (when output-text
                   (insert "```stdout\n")
                   (insert (mapconcat #'identity output-text ""))
                   (insert "\n```\n\n"))
                 (when output-data
                   (when-let ((image64 (alist-get 'image/png output-data)))
                     (let ((image-data (base64-decode-string image64)))
                       (insert-image (create-image image-data 'png t))
                       (insert "\n\n")))))))))))))

#+end_src
** Markdown to Org
#+begin_src emacs-lisp :tangle no

#+end_src

** Right align tags in org buffers :HACK:

#+begin_src emacs-lisp :tangle no
(add-to-list 'font-lock-extra-managed-props 'display)

(defun my-org-mode-font-lock-setup ()
  "Set up custom font lock for org-mode."
  (font-lock-add-keywords nil
                          `(("^.*?\\( \\)\\(:[[:alnum:]_@#%:]+:\\)$"
                             (1 `(face nil
                                  display (space :align-to (- right ,(org-string-width (match-string 2)) 3)))
                                prepend))) t))

(add-hook 'org-mode-hook 'my-org-mode-font-lock-setup)
#+end_src

** Spell checking

#+begin_src emacs-lisp :tangle no
(use-package! jinx
  :defer t
  :init
  (add-hook 'doom-init-ui-hook #'global-jinx-mode)
  :config
  ;; Use my custom dictionary
  ;; (setq jinx-languages "en_US")
  ;; Extra face(s) to ignore
  (push 'org-inline-src-block
        (alist-get 'org-mode jinx-exclude-faces))
  ;; Take over the relevant bindings.
  (after! ispell
    (global-set-key [remap ispell-word] #'jinx-correct))
  (after! evil-commands
    (global-set-key [remap evil-next-flyspell-error] #'jinx-next)
    (global-set-key [remap evil-prev-flyspell-error] #'jinx-previous))
  ;; I prefer for `point' to end up at the start of the word,
  ;; not just after the end.
  (advice-add 'jinx-next :after (lambda (_) (left-word))))

#+end_src

** Changelog automation

#+begin_src emacs-lisp :tangle no
(defun ldn/update-project-changelog ()
  "Update ChangeLog.org with latest git commits under Changelog heading."
  (interactive)
  (let ((readme-file (expand-file-name "ChangeLog.org" (projectile-project-root)))
        (commit-log (shell-command-to-string (expand-file-name "extract_commits.sh" (projectile-project-root)))))
    (if (string-match-p "No new commits to add." commit-log)
        (message "No new commits to add.")
      (with-current-buffer (find-file-noselect readme-file)
        (goto-char (point-min))
        ;; Find the Changelog heading
        (if (re-search-forward "^\\*+ Changelog" nil t)
            (progn
              (forward-line)
              (insert commit-log "\n"))
          (goto-char (point-max))
          (insert "\n* Changelog\n" commit-log "\n"))
        (save-buffer)
        (message "Changelog updated in ChangeLog.org!")))))

(map! :leader
      :desc "Update ChangeLog.org"
      "p u" #'ldn/update-project-changelog)

#+end_src

** symbol-prettifying

#+begin_src emacs-lisp :tangle yes
(defun soph/prettify-symbols-setup ()
  "Beautify keywords"
  (setq prettify-symbols-alist
        (mapcan (lambda (x) (list x (cons (upcase (car x)) (cdr x))))
                '(("#+name:" . "»")
                  ("#+title:" . "")
                  ("#+author:" . "")
                  ("#+description:" . "")
                  ("#+email" . "")
                  ("#+date" . "󰢧")
                  ("#+property" . "󰠳")
                  ("#+options" . #("󰘵" 0 1 (display (height 0.75))))
                  ("#+startup" . "⏻")
                  ("#+macro" . "ℳ")
                  ("#+bind" . "󰌷")
                  ("#+bibliography" . "")
                  ("#+print_bibliography" . "󰌱")
                  ("#+cite_export" . "⮭")
                  ("#+filetags:" . "󰓹")
                  ("#+EXPORT_FILE_NAME" . "")
                ;;("print_glossary" . "󰌱ᴬᶻ")
                ;;("glossary_sources" . "󰒻")
                  ("#+include" . "⇤")
                  ("#+setupfile" . "⇚")
                  ("#+html_head" . "🅷")
                  ("#+html" . "🅗")
                  ("#+latex_class" . "🄻")
                  ("#+latex_class_options" . "🄻󰒓")
                  ("#+latex_header" . "🅻")
                  ("#+latex_header_extra" . "🅻⁺")
                  ("#+latex" . "🅛")
                  ("#+beamer_theme" . "🄱")
                  ("#+beamer_color_theme" . "🄱󰏘")
                  ("#+beamer_font_theme" . "🄱𝐀")
                  ("#+beamer_header" . "🅱")
                  ("#+beamer" . "🅑")
                  ("#+attr_latex" . "🄛")
                  ("#+attr_html" . "🄗")
                  ("#+attr_org" . "⒪")
                  ("#+call" . "󰜎")
                  ("#+header" . "›")
                  ("#+caption" . "☰")
                  ("#+results" . "")
                  ("[ ]" . "")
                  ("[X]" . "󰄵")
                  ("[-]" . "󰡖")
                  ("#+begin_src" . "󰄾")
                  ("#+end_src" . "󰄾")
                  ("#+begin_quote" . "󰝗")
                  ("#+end_quote" . "󰉾")
                  ("#+begin_verse" . "󰴓")
                  ("#+end_verse" . "󰴓")
                  ("#+begin_example" . "")
                  ("#+end_example" . "")
                  (":PROPERTIES:" . "")
                  ("SCHEDULED:" . "󱡡")
                  ("DEADLINE:" . "󰥕")
                  ("CLOSED:" . "󰾨"))))
  (prettify-symbols-mode))

(add-hook 'org-mode-hook        #'soph/prettify-symbols-setup)
(add-hook 'org-agenda-mode-hook #'soph/prettify-symbols-setup)

;; Function to print the final value of prettify-symbols-alist for debugging
(defun print-prettify-symbols-alist ()
  "Print the prettify-symbols-alist for debugging."
  (interactive)
  (message "prettify-symbols-alist: %s" prettify-symbols-alist))

;; Add a hook to print the value after setup
(add-hook 'org-mode-hook #'print-prettify-symbols-alist)
(add-hook 'org-agenda-mode-hook #'print-prettify-symbols-alist)
#+end_src

** gptel
#+begin_src emacs-lisp :tangle no
(setq
 gptel-model "qwen3:0.6b"
 gptel-backend (gptel-make-ollama "Ollama"
                 :host "localhost:11434"
                 :stream t
                 :models '("qwen3:0.6b")))
#+end_src
